I also have the same issue with terraform cloudflare provider 5.0.0.

Sample resource causing an issue:

```
resource "cloudflare_list_item" "example_list_item1" {
  account_id = data.sops_file.secrets.data["cloudflare.account_id"]

  list_id = cloudflare_list.my_redirect_list.id
    redirect = {
      source_url            = "example.com/arch"
      target_url            = "https://archlinux.org/"
      include_subdomains    = true
      preserve_path_suffix  = true
      preserve_query_string = true
      status_code           = 301
      subpath_matching      = true
    }
}
  
```

apply renders the following:
```

Terraform will perform the following actions:

  # cloudflare_list_item.example_list_item1 will be created
  + resource "cloudflare_list_item" "example_list_item1" {
      + account_id   = (sensitive value)
      + comment      = (known after apply)
      + created_on   = (known after apply)
      + id           = (known after apply)
      + item_id      = (known after apply)
      + list_id      = "a153f9022b58458badd77d80f5194590"
      + modified_on  = (known after apply)
      + operation_id = (known after apply)
      + redirect     = {
          + include_subdomains    = true
          + preserve_path_suffix  = true
          + preserve_query_string = true
          + source_url            = "example.com/arch"
          + status_code           = 301
          + subpath_matching      = true
          + target_url            = "https://archlinux.org/"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_list_item.example_list_item1: Creating...
╷
│ Error: Value Conversion Error
│ 
│   with cloudflare_list_item.example_list_item1,
│ An unexpected error was encountered trying to convert tftypes.Value into list_item.ListItemModel. This is always an error in the provider. Please report the following to the provider developer:
│ 
│ mismatch between struct and object: Object defines fields not found in struct: id.

```